results/vllm-mtp.txt
Engine:   vLLM + MTP (num_speculative_tokens=3)
Model:    Inferact/Qwen3.8-27B-NVFP4
Hardware: DGX Spark (GB10), CUDA 13.0
Port:     8000
Harness:  sglang.bench_serving --backend sglang-oai
Tokenizer: Inferact/Qwen3.8-27B-NVFP4

===================================================================
>>> A) random 512/512, single-stream
===================================================================
============ Serving Benchmark Result ============
Max request concurrency:                 1
Successful requests:                     20
Benchmark duration (s):                  512.50
Total input tokens:                      10240
Total generated tokens:                  10240
Request throughput (req/s):              0.04
Output token throughput (tok/s):         19.98
Total token throughput (tok/s):          39.96
Concurrency:                             1.00
Mean E2E Latency (ms):                   25624.46
Mean TTFT (ms):                          439.76
Mean TPOT (ms):                          49.29
Median TPOT (ms):                        48.70
==================================================

===================================================================
>>> B) sharegpt, single-stream
===================================================================
============ Serving Benchmark Result ============
Max request concurrency:                 1
Successful requests:                     20
Benchmark duration (s):                  332.35
Total input tokens:                      8466
Total generated tokens:                  5973
Request throughput (req/s):              0.06
Output token throughput (tok/s):         17.97
Total token throughput (tok/s):          43.45
Concurrency:                             1.00
Mean E2E Latency (ms):                   16616.49
Mean TTFT (ms):                          432.38
Mean TPOT (ms):                          53.47
Median TPOT (ms):                        52.82
==================================================

===================================================================
>>> C) sharegpt, concurrent x4
===================================================================
============ Serving Benchmark Result ============
Max request concurrency:                 4
Successful requests:                     40
Benchmark duration (s):                  157.44
Total input tokens:                      20138
Total generated tokens:                  9667
Request throughput (req/s):              0.25
Output token throughput (tok/s):         61.40
Total token throughput (tok/s):          189.31
Peak output token throughput (tok/s):    28.00
Concurrency:                             3.57
Mean E2E Latency (ms):                   14034.37
Mean TTFT (ms):                          732.93
Mean TPOT (ms):                          57.56
Median TPOT (ms):                        56.88
==================================================